Books_And_Tutorials/Design/Singleton_VS_Static_Class/Singleton_vs_Static_Class.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Singleton vs Static class </title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-01-05 13:16:23 "/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Singleton vs Static class </h1>


<meta http-equiv="Content-Style-Type" content="text/css">
<link rel="stylesheet" href="../../../CSS/org-style.css" type="text/css"/>
<style type="text/css"/>
  pre.display { font-family:inherit }
  pre.format  { font-family:inherit }
  pre.smalldisplay { font-family:inherit; font-size:smaller }
  pre.smallformat  { font-family:inherit; font-size:smaller }
  pre.smallexample { font-size:smaller }
  pre.smalllisp    { font-size:smaller }
  span.sc    { font-variant:small-caps }
  span.roman { font-family:serif; font-weight:normal; } 
  span.sansserif { font-family:sans-serif; font-weight:normal; } 
</style>
<div id="postamble">
<p class="author"> Author: Pralay Patoria
<a href="mailto:ppatoria@gmail.com">&lt;ppatoria@gmail.com&gt;</a>
</p>
<p class="date"> Date: 24-12-2013</p>
</div>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Difference between Singleton and Static class </a></li>
<li><a href="#sec-2">2 <span style="text-decoration:underline;">Do not abuse singleton pattern .</span> </a>
<ul>
<li><a href="#sec-2_1">2.1 Don't abuse singleton pattern (Web Link) </a></li>
<li><a href="#sec-2_2">2.2 Don't abuse singleton pattern (Local LInk) </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Difference between Singleton and Static class </h2>
<div class="outline-text-2" id="text-1">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Singleton Class</th><th scope="col">Static Class</th></tr>
</thead>
<tbody>
<tr><td>Singletons can <b>implement interfaces</b> or <b>inherit/derive</b> from useful base classes, so you can pass around the singleton as if it were "just another" implementation.</td><td>When a class is static (never instantiated as an object), only its static methods can be called. These static methods are limited to the ones that are defined in the class itself; they cannot be inherited from other classes, nor can they be enforced by the definition of an interface.</td></tr>
<tr><td>Singleton might be less efficient due to the overhead of calling the getInstance() method each time you want to use it.</td><td></td></tr>
<tr><td>Singleton object stores in Heap</td><td>Static object stores in stack</td></tr>
<tr><td>A singleton can be initialized lazily or asynchronously.</td><td>Static class is generally initialized when it is first loaded, leading to potential class loader issues.</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <span style="text-decoration:underline;">Do not abuse singleton pattern .</span> </h2>
<div class="outline-text-2" id="text-2">

<p>The singleton pattern is appropriately used when you have an interface and multiple implementations of that interface.  Lets extend this example slightly, and imagine that the system can be configured to either store user information in a XML file, or in a database.  You will also need a Factory class that determines which of several implementations to instantiate, in this case based on system configuration values, and returns the correct, single instance.
</p>

</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3">2.1</span> <a href="http://agiletribe.wordpress.com/2013/10/08/dont-abuse-singleton-pattern/">Don't abuse singleton pattern (Web Link)</a> </h3>
<div class="outline-text-3" id="text-2_1">

</div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2"><span class="section-number-3">2.2</span> <a href="Dont_abuse_singleton_pattern.html">Don't abuse singleton pattern (Local LInk)</a> </h3>
<div class="outline-text-3" id="text-2_2">

</div>
</div>
</div>
<div id="postamble">
<p class="date"> Date: 2014-01-05 13:16:23 </p>
</div>
</div>
</body>
</html>
